# Install mas to allow installation of Mac App Store apps from this Brewfile
brew "mas"

brew "git"

brew "chruby"
brew "ruby-install"

tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"

brew "starship"

# Install GNU Stow for managing symlinked dotfiles
brew "stow"

# Install direnv for managing per-project environments
brew "direnv"

# Install Raycast for a productive launcher
cask "raycast"

# Install Magnet for window management
mas "Magnet", id: 441258766

# Install Mozilla Firefox
cask "firefox"

# Install 1Password for password management
cask "1password"

# Install ripgrep (rg) for a faster grep utility
brew "ripgrep"

# Install exa, a modern replacement for ls
brew "exa"

# Install neovim
brew "neovim"

# Install zoxide for a better cd command
brew "zoxide"

# Install fzf for a command-line fuzzy finder
brew "fzf"
