# Install mas to allow installation of Mac App Store apps from this Brewfile
brew "mas"

brew "git"

brew "chruby"
brew "ruby-install"

tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"

# Install Starship prompt for zsh
brew "starship"

# Install GNU Stow for managing symlinked dotfiles
brew "stow"

# Install direnv for managing per-project environments
brew "direnv"

# Install Raycast for a productive launcher
cask "raycast"

# Install Magnet for window management
mas "Magnet", id: 441258766

# Install Mozilla Firefox
cask "firefox"

# Install 1Password for password management
cask "1password"
cask "1password/tap/1password-cli"

# Install ripgrep (rg) for a faster grep utility
brew "ripgrep"

# Install exa, a modern replacement for ls
brew "exa"

# Install neovim
brew "neovim"

# Install zoxide for a better cd command
brew "zoxide"

# Install fzf for a command-line fuzzy finder
brew "fzf"

# Install overmind for a process manager for Procfile-based applications
brew "overmind"

# Install Todoist for a reminders & project planner
mas "Todoist", id: 585829637

# Install Syncthing for continuous file synchronization
brew "syncthing"

# Install Topnotch to hide the notch
cask "topnotch"

# Install amphetamine for a powerful keep-awake utility
mas "Amphetamine", id: 937984704

# Install jq for a JSON manipulation tool
brew "jq"

# Install fd as a fast alternative to "find"
brew "fd"

# Install bat as a cat clone with syntax highlighting and Git integration
brew "bat"

# Install SQLite
brew "sqlite"
